import networkx as nx

# Список міст
cities = [
    "Київ", "Харків", "Одеса", "Дніпро", "Львів", "Запоріжжя", "Вінниця",
    "Полтава", "Чернігів", "Житомир", "Миколаїв", "Херсон",
    "Черкаси", "Івано-Франківськ", "Тернопіль"
]

# Створення графа
G = nx.Graph()
G.add_nodes_from(cities)

edges = [
    ("Київ", "Житомир", 140),
    ("Київ", "Чернігів", 150),
    ("Київ", "Полтава", 340),
    ("Київ", "Черкаси", 190),
    ("Київ", "Вінниця", 270),
    ("Київ", "Львів", 540),
    ("Житомир", "Львів", 350),
    ("Житомир", "Вінниця", 120),
    ("Вінниця", "Одеса", 430),
    ("Одеса", "Миколаїв", 130),
    ("Миколаїв", "Херсон", 70),
    ("Полтава", "Харків", 140),
    ("Полтава", "Дніпро", 200),
    ("Дніпро", "Запоріжжя", 85),
    ("Дніпро", "Одеса", 520),
    ("Львів", "Тернопіль", 130),
    ("Тернопіль", "Івано-Франківськ", 130),
    ("Івано-Франківськ", "Львів", 140)
]

for a, b, dist in edges:
    G.add_edge(a, b, weight=dist)
